<b>Features Required</b>

-> Content Based RS : 
'movie_id'
'title'
'overview'
'genres'
'keywords'
'cast'
'crew': (Director)
'release year'

-> Collaborative Filtering RS : 
'User-id'
'movie-id'
'rating'
'review'

In [2]:
import pandas as pd
import numpy as np
import aiohttp
import asyncio
import requests
import time
import os
import warnings
import pickle

warnings.filterwarnings('ignore')

Films of year 1991

In [351]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1991"
m1991 = pd.read_html(url)[2]

In [352]:
m1991.shape

(229, 5)

In [353]:
m1991.head()

,Title,Director,Cast,Genre,Notes
0,29th Street,George Gallo,"Danny Aiello, Anthony LaPaglia",Drama,Fox
1,Across the Tracks,Sandy Tung,"Rick Schroder, Brad Pitt, Carrie Snodgress",Drama,NaN
2,The Addams Family,Barry Sonnenfeld,"Anjelica Huston, Raúl Juliá, Christopher Lloyd...",Comedy,Charles Addams characters
3,All I Want for Christmas,Robert Lieberman,"Harley Jane Kozak, Thora Birch, Ethan Embry, J...",Comedy,Paramount
4,American Kickboxer,Frans Nel,John Barrett,"Martial Arts, Action",NaN

In [354]:
m1991 = m1991[['Title']]   #keep title and 
m1991.head()                              #remaining attributes can be collected from TMDB api

                      Title
0               29th Street
1         Across the Tracks
2         The Addams Family
3  All I Want for Christmas
4        American Kickboxer

In [355]:
m1991['release_year'] = np.full(shape=m1991.shape[0], fill_value=1991, dtype=int) #adding release year

In [356]:
m1991.head()

                      Title  release_year
0               29th Street          1991
1         Across the Tracks          1991
2         The Addams Family          1991
3  All I Want for Christmas          1991
4        American Kickboxer          1991

Films of year 1992

In [357]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1992"
m1992 = pd.DataFrame()

for table in range(2, 12): #10 table
    m1992 = pd.concat([m1992, pd.read_html(url)[table]], ignore_index=True)

In [358]:
m1992.head()

,Title,Director,Cast,Genre,Notes
0,1492: Conquest of Paradise,Ridley Scott,"Gérard Depardieu, Armand Assante, Sigourney We...","Drama, Biography",on Christopher Columbus
1,1991: The Year Punk Broke,Dave Markey,NaN,Documentary,NaN
2,3 Ninjas,Jon Turteltaub,"Michael Treanor, Max Elliott Slade, Victor Won...","Martial Arts, Comedy",NaN
3,976-Evil II,Jim Wynorski,"Patrick O'Bryan, Debbie James, Rene Assa",Supernatural Horror,sequel to 1988 film 976-EVIL
4,Aces: Iron Eagle III,John Glen,"Louis Gossett Jr, Sonny Chiba",Action,NaN

In [359]:
m1992.shape

(247, 5)

In [360]:
m1992 = m1992[['Title']]
m1992.head()

                        Title
0  1492: Conquest of Paradise
1   1991: The Year Punk Broke
2                    3 Ninjas
3                 976-Evil II
4        Aces: Iron Eagle III

In [361]:
m1992['release_year'] = np.full(shape=m1992.shape[0], fill_value=1992, dtype=int) #adding release year

In [362]:
m1992.head()

                        Title  release_year
0  1492: Conquest of Paradise          1992
1   1991: The Year Punk Broke          1992
2                    3 Ninjas          1992
3                 976-Evil II          1992
4        Aces: Iron Eagle III          1992

Films of year 1993

In [363]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1993"
m1993 = pd.read_html(url)[3]

In [364]:
m1993.shape

(219, 5)

In [365]:
m1993 = m1993[['Title']]
m1993.head()

                                            Title
0                               Acting on Impulse
1                            Addams Family Values
2                     The Adventures of Huck Finn
3                            The Age of Innocence
4  Aileen Wuornos: The Selling of a Serial Killer

In [366]:
m1993['release_year'] = np.full(shape=m1993.shape[0], fill_value=1993, dtype=int) #adding release year
m1993.head()

                                            Title  release_year
0                               Acting on Impulse          1993
1                            Addams Family Values          1993
2                     The Adventures of Huck Finn          1993
3                            The Age of Innocence          1993
4  Aileen Wuornos: The Selling of a Serial Killer          1993

Films of year 1994

In [367]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1994"
m1994 = pd.DataFrame()

for table in range(2, 28): # 27 tables
    m1994 = pd.concat([m1994, pd.read_html(url)[table]], ignore_index=True)

In [368]:
m1994.shape

(301, 5)

In [369]:
m1994.head()

,Title,Director,Cast,Genre,Notes
0,3 Chains o' Gold,Three directors,NaN,Musical,direct-to-video
1,3 Ninjas Kick Back,Charles T. Kanganis,"Victor Wong, Max Elliott Slade, Sean Fox, J. E...",Martial Arts,Preceded by 3 Ninjas
2,8 Seconds,John G. Avildsen,"Luke Perry, Stephen Baldwin, Cynthia Gibb",Biopic,NaN
3,Above the Rim,Jeff Pollack,"Duane Martin, Leon, Tupac Shakur",Drama,NaN
4,Abraham,Joseph Sargent,"Richard Harris, Barbara Hershey",Drama,Made-for-TV

In [370]:
m1994 = m1994[['Title']]
m1994.head()

                Title
0    3 Chains o' Gold
1  3 Ninjas Kick Back
2           8 Seconds
3       Above the Rim
4             Abraham

In [371]:
m1994['release_year'] = np.full(shape=m1994.shape[0], fill_value=1994, dtype=int) #adding release year
m1994.head()

                Title  release_year
0    3 Chains o' Gold          1994
1  3 Ninjas Kick Back          1994
2           8 Seconds          1994
3       Above the Rim          1994
4             Abraham          1994

Films of year 1995

In [372]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1995"
m1995 = pd.DataFrame()

for table in range(3, 11): # 8 tables
    m1995 = pd.concat([m1995, pd.read_html(url)[table]], ignore_index=True)

In [373]:
m1995.shape

(324, 5)

In [374]:
m1995.tail()

,Title,Director,Cast,Genre,Note
319,Wild Bill,Walter Hill,"Jeff Bridges, Ellen Barkin, David Arquette, Jo...",Western,NaN
320,Wild Side,Donald Cammell,"Christopher Walken, Anne Heche, Joan Chen",Thriller,direct-to-video
321,Wings of Courage,Jean-Jacques Annaud,"Craig Sheffer, Elizabeth McGovern",IMAX,40 min.
322,Without Evidence,Gill Dennis,"Scott Plank, Angelina Jolie",Drama,NaN
323,The Wrong Woman,Douglas Jackson,"Nancy McKeon, Chelsea Field",Drama,Made-for-TV

In [375]:
m1995 = m1995[['Title']]   
m1995['release_year'] = np.full(shape=m1995.shape[0], fill_value=1995, dtype=int) #adding release year
m1995.head()

                            Title  release_year
0                      12 Monkeys          1995
1             3 Ninjas Knuckle Up          1995
2                 Above Suspicion          1995
3  Ace Ventura: When Nature Calls          1995
4                   The Addiction          1995

Films of year 1996

In [376]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1996"
m1996 = pd.DataFrame()

for table in range(3, 11): # 8 tables
    m1996 = pd.concat([m1996, pd.read_html(url)[table]], ignore_index=True)

In [377]:
m1996.shape

(372, 6)

In [378]:
m1996.head()

,Title,Director,Cast,Genre,Notes,Note
0,101 Dalmatians,Stephen Herek,"Glenn Close, Jeff Daniels, Joely Richardson, J...",Comedy,NaN,NaN
1,2 Days in the Valley,John Herzfeld,"Danny Aiello, Jeff Daniels, James Spader, Char...","Comedy, Crime",NaN,NaN
2,Adrenalin: Fear the Rush,Albert Pyun,"Christopher Lambert, Natasha Henstridge",Science fiction,NaN,NaN
3,The Adventures of Pinocchio,Steve Barron,"Martin Landau, Jonathan Taylor Thomas, Udo Kie...",Fantasy,NaN,NaN
4,Aladdin and the King of Thieves,Tad Stones,"Scott Weinger, Robin Williams, John Rhys-Davies",Animation,direct-to-video sequel,NaN

In [379]:
m1996 = m1996[['Title']]
m1996['release_year'] = np.full(shape=m1996.shape[0], fill_value=1996, dtype=int) #adding release year
m1996.head()

                             Title  release_year
0                   101 Dalmatians          1996
1             2 Days in the Valley          1996
2         Adrenalin: Fear the Rush          1996
3      The Adventures of Pinocchio          1996
4  Aladdin and the King of Thieves          1996

Films of year 1997

In [380]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1997"
m1997 = pd.DataFrame()

for table in range(3, 28): # 27 tables
    m1997 = pd.concat([m1997, pd.read_html(url)[table]], ignore_index=True)

In [381]:
m1997.shape

(378, 5)

In [382]:
m1997.tail()

,Title,Director,Cast,Genre,Notes
373,The Wrong Guy,David Steinberg,"Dave Foley, Jennifer Tilly, David Higgins, Col...","Comedy, Crime",Canada
374,Year of the Horse,Jim Jarmusch,NaN,Documentary,Neil Young concert tour
375,Young Thugs: Innocent Blood,Takashi Miike,NaN,NaN,Japan
376,Young and Dangerous 4,Andrew Lau,"Ekin Cheng, Jordan Chan",Triad,British Hong Kong
377,Zeus and Roxanne,George T. Miller,"Steve Guttenberg, Kathleen Quinlan","Family, Adventure",Metro-Goldwyn-Mayer

In [383]:
m1997 = m1997[['Title']]
m1997['release_year'] = np.full(shape=m1997.shape[0], fill_value=1997, dtype=int) #adding release year
m1997.head()

                          Title  release_year
0             …First Do No Harm          1997
1                  12 Angry Men          1997
2  20,000 Leagues Under the Sea          1997
3  20,000 Leagues Under the Sea          1997
4                4 Little Girls          1997

Films of year 1998

In [384]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1998"
m1998 = pd.read_html(url)[3]

In [385]:
m1998.shape

(258, 5)

In [386]:
m1998.tail()

,Title,Director,Cast (Subject of documentary),Genre,Notes
253,Wrongfully Accused,Pat Proft,"Leslie Nielsen, Richard Crenna, Melinda McGraw...",Comedy,parody of The Fugitive
254,The X-Files,Rob Bowman,"Gillian Anderson, David Duchovny, Martin Landau",Science Fiction,Based on the TV series
255,Your Friends & Neighbors,Neil LaBute,"Amy Brenneman, Aaron Eckhart, Nastassja Kinski...",Drama,Gramercy Pictures
256,You've Got Mail,Nora Ephron,"Tom Hanks, Meg Ryan, Greg Kinnear, Parker Pose...",Rom Com,NaN
257,Zero Effect,Jake Kasdan,"Bill Pullman, Ryan O'Neal, Ben Stiller",Drama,Columbia

In [387]:
m1998 = m1998[['Title']]
m1998['release_year'] = np.full(shape=m1998.shape[0], fill_value=1998, dtype=int) #adding release year
m1998.head()

                                  Title  release_year
0  3 Ninjas: High Noon at Mega Mountain          1998
1                              20 Dates          1998
2                                    54          1998
3                 Addams Family Reunion          1998
4      The Adventures of Sebastian Cole          1998

Films of year 1999

In [388]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_1999"
m1999 = pd.read_html(url)[2]

In [389]:
m1999.shape

(240, 6)

In [390]:
m1999.tail()

,Title,Director,Cast (Subject of documentary),Genre,Notes,Unnamed: 5
235,Wisconsin Death Trip,NaN,NaN,NaN,NaN,NaN
236,The Woman Chaser,Robinson Devor,Patrick Warburton,Comedy,NaN,NaN
237,A Woman Scorned,Treva Etienne,Marcia Johnson,Thriller,NaN,NaN
238,The Wood,Rick Famuyiwa,"Omar Epps, Richard T. Jones, Taye Diggs",Comedy,NaN,NaN
239,The World Is Not Enough,Michael Apted,"Pierce Brosnan, Sophie Marceau, Robert Carlyle...","Spy, Action",NaN,NaN

In [391]:
m1999 = m1999[['Title']]
m1999['release_year'] = np.full(shape=m1999.shape[0], fill_value=1999, dtype=int) #adding release year
m1999.head()

                        Title  release_year
0  10 Things I Hate About You          1999
1            The 13th Warrior          1999
2              200 Cigarettes          1999
3               The 4th Floor          1999
4                         8mm          1999

Films 0f year 2000

In [392]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2000"
m2000 = pd.read_html(url)[2]

In [393]:
m2000.shape

(218, 5)

In [394]:
m2000.tail()

,Title,Director,Cast,Genre,Notes
213,Woman on Top,Fina Torres,Penélope Cruz,Comedy,Fox Searchlight Pictures
214,Wonder Boys,Curtis Hanson,"Michael Douglas, Tobey Maguire, Frances McDorm...","Comedy, Drama",Based on novel by Michael Chabon; Academy Awar...
215,X-Men,Bryan Singer,"Hugh Jackman, Patrick Stewart, Ian McKellen",Superhero,20th Century Fox; Based on the X-Men
216,The Yards,James Gray,"Mark Wahlberg, Charlize Theron, Joaquin Phoeni...",Crime Drama,Buena Vista Pictures
217,You Can Count on Me,Kenneth Lonergan,"Laura Linney, Mark Ruffalo, Matthew Broderick",Drama,won Grand Jury Prize: Dramatic

In [395]:
m2000 = m2000[['Title']]
m2000['release_year'] = np.full(shape=m2000.shape[0], fill_value=2000, dtype=int) #adding release year
m2000.head()

             Title  release_year
0   102 Dalmatians          2000
1          28 Days          2000
2        3 Strikes          2000
3      The 6th Day          2000
4  Across the Line          2000

Films of year 2001

In [396]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2001"
m2001 = pd.read_html(url)[3]

In [397]:
m2001.shape

(236, 5)

In [398]:
m2001.tail()

,Title,Director,Cast(Subject of documentary),Genre,Notes
231,Wet Hot American Summer,David Wain,"Janeane Garofalo, Paul Rudd, Molly Shannon",Comedy,NaN
232,What's the Worst That Could Happen?,Sam Weisman,"Martin Lawrence, Danny DeVito, Bernie Mac",Comedy,based on What's the Worst That Could Happen? b...
233,When Strangers Appear,Scott Reynolds,"Radha Mitchell, Barry Watson, Josh Lucas",Drama,NaN
234,The Zeros,John Ryman,"Rachel Wilson, Jennifer Morrison, Kyle Gass",Science fiction,NaN
235,Zoolander,Ben Stiller,"Ben Stiller, Owen Wilson, Christine Taylor",Comedy,NaN

In [399]:
m2001 = m2001[['Title']]
m2001['release_year'] = np.full(shape=m2001.shape[0], fill_value=2001, dtype=int) #adding release year
m2001.head()                                  #remaining attributes can be collected from TMDB api

                          Title  release_year
0                    15 Minutes          2001
1                        3 A.M.          2001
2       3000 Miles to Graceland          2001
3                           61*          2001
4  A.I. Artificial Intelligence          2001

Films of year 2002

In [400]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2002"
m2002 = pd.read_html(url)[3]

In [401]:
m2002.head()

,Rank,Title,Distributor,Domestic gross
0,1,Spider-Man,Sony Pictures,"$403,706,375"
1,2,The Lord of the Rings: The Two Towers,New Line Cinema,"$339,789,881"
2,3,Star Wars: Episode II - Attack of the Clones,Twentieth Century Fox,"$302,191,252"
3,4,Harry Potter and the Chamber of Secrets,Warner Bros.,"$261,988,482"
4,5,My Big Fat Greek Wedding,IFC Films,"$241,438,208"

In [402]:
m2002.tail()

   Rank                        Title            Distributor Domestic gross
5     6                        Signs                 Disney   $227,966,634
6     7  Austin Powers in Goldmember        New Line Cinema   $213,307,889
7     8              Men in Black II          Sony Pictures   $190,418,803
8     9                      Ice Age  Twentieth Century Fox   $176,387,405
9    10                      Chicago                Miramax   $170,687,518

In [403]:
m2002 = m2002[['Title']]
m2002['release_year'] = np.full(shape=m2002.shape[0], fill_value=2002, dtype=int) #adding release year
m2002.head()                                    #remaining attributes can be collected from TMDB api

                                          Title  release_year
0                                    Spider-Man          2002
1         The Lord of the Rings: The Two Towers          2002
2  Star Wars: Episode II - Attack of the Clones          2002
3       Harry Potter and the Chamber of Secrets          2002
4                      My Big Fat Greek Wedding          2002

Films of year 2003

In [404]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2003"
m2003 = pd.read_html(url)[4]

In [405]:
m2003.shape

(225, 5)

In [406]:
m2003.tail()

,Title,Director,Cast (Subject of documentary),Genre,Notes
220,Wrong Turn,Rob Schmidt,"Desmond Harrington, Eliza Dushku, Jeremy Sisto...",Horror,NaN
221,X2: X-Men United,Bryan Singer,"Hugh Jackman, Patrick Stewart, Ian McKellen, F...",Superhero,Preceded by X-Men
222,The Yes Men,"Dan Ollman, Sarah Price, Chris Smith",The culture jamming exploits of The Yes Men,Documentary,NaN
223,The Young Black Stallion,Simon Wincer,"Biana Tamimi, Patrick Elyas, Eric Grucza","Drama, Family",Prequel to The Black Stallion
224,Zero Day,Ben Coccio,"Andre Keuck, Cal Robertson",Drama,NaN

In [407]:
m2003 = m2003[['Title']]
m2003['release_year'] = np.full(shape=m2003.shape[0], fill_value=2003, dtype=int) #adding release year
m2003.head()                                  #remaining attributes can be collected from TMDB api

                                         Title  release_year
0                                        11:14          2003
1  101 Dalmatians II: Patch's London Adventure          2003
2                             2 Fast 2 Furious          2003
3                                     21 Grams          2003
4    44 Minutes: The North Hollywood Shoot-Out          2003

let's concat the movies upto 2003 to make one data frame title_df1

In [408]:
#storing in temp_df1 variable
title_df1 = pd.concat([m1991, m1992, m1993, m1994, m1995, m1996, m1997, m1998, m1999, m2000, m2001, m2002, m2003], ignore_index=True)

In [409]:
title_df1.tail()

                         Title  release_year
3252                Wrong Turn          2003
3253          X2: X-Men United          2003
3254               The Yes Men          2003
3255  The Young Black Stallion          2003
3256                  Zero Day          2003

In [410]:
title_df1.shape

(3257, 2)

In [411]:
title_df1.isna().sum()

Title           1
release_year    0
dtype: int64

In [412]:
title_df1.drop(title_df1[title_df1['Title'].isna()==True].index, inplace=True) #dropping row with null in Title
title_df1.reset_index(inplace=True, drop=True)

In [413]:
title_df1.isna().sum()

Title           0
release_year    0
dtype: int64

Films of year 2004

In [414]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2004"
m2004 = pd.DataFrame()

for table in range(2, 6):
    m2004 = pd.concat([m2004, pd.read_html(url)[table]], ignore_index=True)

In [415]:
m2004.shape

(213, 8)

In [416]:
m2004.tail()

,Opening,Opening.1,Title,Production company,Cast and crew,Genre,Ref.,Unnamed: 7
208,D E C E M B E R,29.0,In Good Company,Universal Pictures,Paul Weitz (director/screenplay); Dennis Quaid...,"Comedy, Drama, Romance",NaN,NaN
209,D E C E M B E R,29.0,A Love Song for Bobby Long,Lions Gate Films / Destination Films,Shainee Gabel (director/screenplay); John Trav...,Drama,NaN,NaN
210,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN,NaN
211,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN,NaN
212,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [417]:
m2004 = m2004[['Title']]
m2004['release_year'] = np.full(shape=m2004.shape[0], fill_value=2004, dtype=int) #adding release year
m2004.head()                                  #remaining attributes can be collected from TMDB api

              Title  release_year
0   Chasing Liberty          2004
1   My Baby's Daddy          2004
2  Along Came Polly          2004
3  The Goodbye Girl          2004
4     Pixel Perfect          2004

Films of year 2005

In [418]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2005"
m2005 = pd.DataFrame()

for table in range(2, 6):
    m2005 = pd.concat([m2005, pd.read_html(url)[table]], ignore_index=True)

In [419]:
m2005.shape

(200, 7)

In [420]:
m2005.tail()

,Opening,Opening.1,Title,Production company,Cast and crew,Genre,Ref.
195,D E C E M B E R,25.0,Rumor Has It,Warner Bros. Pictures / Village Roadshow Pictures,Rob Reiner (director); Ted Griffin (screenplay...,"Romance, Comedy",NaN
196,D E C E M B E R,28.0,Match Point,DreamWorks Pictures,Woody Allen (director/screenplay); Jonathan Rh...,Thriller,NaN
197,D E C E M B E R,29.0,The Matador,The Weinstein Company / Miramax Films / Stratu...,Richard Shepard (director/screenplay); Pierce ...,"Black Comedy, Crime",NaN
198,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN
199,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN

In [421]:
m2005 = m2005[['Title']]
m2005['release_year'] = np.full(shape=m2005.shape[0], fill_value=2005, dtype=int) #adding release year
m2005.head()                              #remaining attributes can be collected from TMDB api

               Title  release_year
0        White Noise          2005
1       Coach Carter          2005
2            Elektra          2005
3  Now You See It...          2005
4     Racing Stripes          2005

Films of yaer 2006

In [422]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2006"
m2006 = pd.DataFrame()

for table in range(2, 6):
    m2006 = pd.concat([m2006, pd.read_html(url)[table]], ignore_index=True)

In [423]:
m2006.shape

(185, 5)

In [424]:
m2006.tail()

,Opening,Opening.1,Title,Production company,Cast and crew
180,D E C E M B E R,22.0,We Are Marshall,Warner Bros. Pictures / Legendary Pictures,McG (director); Jamie Linden (screenplay); Mat...
181,D E C E M B E R,25.0,Black Christmas,Metro-Goldwyn-Mayer / Dimension Films / 2929 E...,Glen Morgan (director/screenplay); Katie Cassi...
182,D E C E M B E R,25.0,Children of Men,Universal Pictures / Strike Entertainment,Alfonso Cuarón (director/screenplay); Mark Fer...
183,D E C E M B E R,25.0,Notes on a Scandal,Fox Searchlight Pictures,"Judi Dench, Cate Blanchett"
184,D E C E M B E R,27.0,Perfume: The Story of a Murderer,DreamWorks Pictures,Tom Tykwer (director/screenplay); Andrew Birki...

In [425]:
m2006 = m2006[['Title']]
m2006['release_year'] = np.full(shape=m2006.shape[0], fill_value=2006, dtype=int) #adding release year
m2006.head()                                  #remaining attributes can be collected from TMDB api

           Title  release_year
0     BloodRayne          2006
1  Grandma's Boy          2006
2         Hostel          2006
3     Glory Road          2006
4    Hoodwinked!          2006

Films of year 2007

In [426]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2007"
m2007 = pd.DataFrame()

for table in range(2, 6):
    m2007 = pd.concat([m2007, pd.read_html(url)[table]], ignore_index=True)

In [427]:
m2007.shape

(259, 5)

In [428]:
m2007.head()

,Opening,Opening.1,Title,Production company,Cast and crew
0,J A N U A R Y,5.0,Code Name: The Cleaner,New Line Cinema,"Les Mayfield (director); Robert Adetuyi, Georg..."
1,J A N U A R Y,5.0,Freedom Writers,Paramount Pictures / MTV Films,Richard LaGravenese (director/screenplay); Hil...
2,J A N U A R Y,5.0,Happily N'Ever After,Lionsgate / Vanguard Animation,Paul J. Bolger (director); Rob Moreland (scree...
3,J A N U A R Y,5.0,Three,Fox Faith / The Bigger Picture,Robby Henson (director); Alan B. McElroy (scre...
4,J A N U A R Y,10.0,Murder Party,Magnolia Pictures,Jeremy Saulnier (director/screenplay); Chris S...

In [429]:
m2007 = m2007[['Title']]
m2007['release_year'] = np.full(shape=m2007.shape[0], fill_value=2007, dtype=int) #adding release year
m2007.head()                                  #remaining attributes can be collected from TMDB api

                    Title  release_year
0  Code Name: The Cleaner          2007
1         Freedom Writers          2007
2    Happily N'Ever After          2007
3                   Three          2007
4            Murder Party          2007

Films of year 2008

In [430]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2008"
m2008 = pd.DataFrame()

for table in range(2, 6):
    m2008 = pd.concat([m2008, pd.read_html(url)[table]], ignore_index=True)

In [431]:
m2008.shape

(276, 5)

In [432]:
m2008.tail()

,Opening,Opening.1,Title,Production company,Cast and crew
271,D E C E M B E R,25.0,The Spirit,Lionsgate,Frank Miller (director/screenplay); Gabriel Ma...
272,D E C E M B E R,25.0,Valkyrie,Metro-Goldwyn-Mayer / United Artists,Bryan Singer (director); Christopher McQuarrie...
273,D E C E M B E R,25.0,Waltz with Bashir,Sony Pictures Classics,"Ari Folman (director/screenplay); Ari Folman, ..."
274,D E C E M B E R,26.0,Revolutionary Road,DreamWorks Pictures / Paramount Vantage / BBC ...,Sam Mendes (director); Justin Haythe (screenpl...
275,D E C E M B E R,31.0,Defiance,Paramount Vantage,Edward Zwick (director/screenplay); Clayton Fr...

In [433]:
m2008 = m2008[['Title']]
m2008['release_year'] = np.full(shape=m2008.shape[0], fill_value=2008, dtype=int) #adding release year
m2008.head()                                  #remaining attributes can be collected from TMDB api

                        Title  release_year
0  The Killing of John Lennon          2008
1             One Missed Call          2008
2               A Bloody Aria          2008
3  The Business of Being Born          2008
4                First Sunday          2008

Films of year 2009

In [434]:
url = "https://en.wikipedia.org/wiki/List_of_American_films_of_2009"
m2009 = pd.DataFrame()

for table in range(2, 6):
    m2009 = pd.concat([m2009, pd.read_html(url)[table]], ignore_index=True)

In [435]:
m2009.shape

(402, 5)

In [436]:
m2009.tail()

,Opening,Opening.1,Title,Production company,Cast and crew
397,D E C E M B E R,25,The Imaginarium of Doctor Parnassus,Sony Pictures Classics,Terry Gilliam (director/screenplay); Charles M...
398,D E C E M B E R,25,It's Complicated,Universal Pictures / Relativity Media,Nancy Meyers (director/screenplay); Meryl Stre...
399,D E C E M B E R,25,Sherlock Holmes,Warner Bros. Pictures / Village Roadshow Pictu...,Guy Ritchie (director); Michael Robert Johnson...
400,D E C E M B E R,30,The Loss of a Teardrop Diamond,Screen Media Films,"Jodie Markell (director); Bryce Dallas Howard,..."
401,D E C E M B E R,30,The White Ribbon,Sony Pictures Classics,Michael Haneke (director/screenplay); Ulrich T...

In [437]:
m2009 = m2009[['Title']]
m2009['release_year'] = np.full(shape=m2009.shape[0], fill_value=2009, dtype=int) #adding release year
m2009.head()                              #remaining attributes can be collected from TMDB api

             Title  release_year
0        Cargo 200          2009
1       Bride Wars          2009
2       The Unborn          2009
3  Cherry Blossoms          2009
4   Hotel for Dogs          2009

Films in year 2010 - 2020

In [438]:
m10_22 = pd.DataFrame()
for y in range(2010, 2023):   #from 2010 - 2022
    url = "https://en.wikipedia.org/wiki/List_of_American_films_of_{}".format(y)
    
    for table in range(2, 6):
        m10_22 = pd.concat([m10_22, pd.read_html(url)[table]], ignore_index=True)

In [439]:
m10_22.shape

(3493, 8)

In [440]:
m10_22.head(5)

,Opening,Opening.1,Title,Production Company,Cast and crew,Production company,.mw-parser-output .tooltip-dotted{border-bottom:1px dotted;cursor:help}Ref.,Ref.
0,J A N U A R Y,2.0,Winter Day Dreams ft. Franny's Feet and Olivia,Kidtoon Films,"Joanne Boreham (director, Franny's Feet); Phoe...",NaN,NaN,NaN
1,J A N U A R Y,6.0,Garbage Dreams,Wynne Films,Mai Iskander (director),NaN,NaN,NaN
2,J A N U A R Y,6.0,Sweetgrass,The Cinema Guild,Lucien Castaing-Taylor & Ilisa Barbash (direct...,NaN,NaN,NaN
3,J A N U A R Y,8.0,Daybreakers,Lionsgate / Film Finance Corporation Australia,Peter Spierig & Michael Spierig (directors/scr...,NaN,NaN,NaN
4,J A N U A R Y,8.0,Leap Year,Universal Pictures / Spyglass Entertainment,"Anand Tucker (director); Harry Elfont, Deborah...",NaN,NaN,NaN

In [441]:
m10_22.tail(5)

,Opening,Opening.1,Title,Production Company,Cast and crew,Production company,.mw-parser-output .tooltip-dotted{border-bottom:1px dotted;cursor:help}Ref.,Ref.
3488,D E C E M B E R,30.0,"Alice, Darling",NaN,Mary Nighy (director); Alanna Francis (screenp...,Lionsgate / Elevation Pictures,NaN,[261]
3489,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3490,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3491,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3492,D E C E M B E R,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [442]:
m10_22 = m10_22[['Title']]
m10_22.head()                                 #remaining attributes can be collected from TMDB api

                                            Title
0  Winter Day Dreams ft. Franny's Feet and Olivia
1                                  Garbage Dreams
2                                      Sweetgrass
3                                     Daybreakers
4                                       Leap Year

titles of movies from 2004 to 2009 stored in temp_df1

In [443]:
#storing all in temp_df2
title_df1 = pd.concat([title_df1, m2004, m2005, m2006, m2007, m2008, m2009], ignore_index=True)

In [444]:
title_df1.shape

(4791, 2)

In [445]:
title_df1.isna().sum()

Title           24
release_year     0
dtype: int64

In [446]:
title_df1.dropna(axis=0, inplace=True) #removing null
title_df1.reset_index(drop=True, inplace=True)

In [447]:
title_df1.shape

(4767, 2)

since we do'nt have release_year in m10_22, let's collect data once again later with including release year

In [82]:
title_df1 = pd.read_csv(r"C:\Users\P PAVAN REDDY\Documents\My Files\Movie Recommendation system\Notebooks\title_df1.csv")

In [83]:
title_df1.head()

                      Title  release_year
0               29th Street          1991
1         Across the Tracks          1991
2         The Addams Family          1991
3  All I Want for Christmas          1991
4        American Kickboxer          1991

make api calls using movie title to the MovieDataBase api present in rapid api website

In [84]:
def call_apis(session, df):
    tasks = []
    for i in range(df.shape[0]):
        url = "https://moviesdatabase.p.rapidapi.com/titles/search/title/{}"
        querystring = {"exact":"true","year":"{}".format(df.iloc[i]['release_year']),"titleType":"movie"}
        headers = {
            "X-RapidAPI-Key": "ef44d30bedmsh7d2930aa0e90321p11240djsnf550adfe0503",
            "X-RapidAPI-Host": "moviesdatabase.p.rapidapi.com"
            }
        
        tasks.append(asyncio.create_task(session.get(url.format(df.iloc[i]['Title']), headers=headers, params=querystring)))

    return tasks

async def get_data(df):
    """ It gives ids, titles, overview, genre_ids, popularity, vote_average, vote_count"""
    async with aiohttp.ClientSession() as session:
        tasks = call_apis(session, df)
        responses = await asyncio.gather(*tasks)
        json_responses = []
        for response in responses:
            json_response = await response.json()
            json_responses.append(json_response)
    
        return json_responses

In [85]:
json_responses = await get_data(title_df1)

In [86]:
len(json_responses)

4767

In [87]:
json_responses_df = pd.DataFrame(json_responses)

In [88]:
json_responses_df['results'].isna().sum()

9

In [89]:
json_responses_df['results'][json_responses_df['results'].isna() == True].index

Int64Index([73, 289, 804, 1803, 2836, 3349, 3498, 4336, 4743], dtype='int64')

In [90]:
#let's merge json_responses_df with title_df1
json_results_df1 = pd.concat([title_df1, json_responses_df[['results']]], axis=1)

In [91]:
json_results_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4767 entries, 0 to 4766
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         4767 non-null   object
 1   release_year  4767 non-null   int64
 2   results       4758 non-null   object
dtypes: int64(1), object(2)
memory usage: 111.9+ KB

In [92]:
json_results_df1.dropna(inplace=True)
json_results_df1.reset_index(drop=True, inplace=True)

In [93]:
json_results_df1.head()

,Title,release_year,results
0,29th Street,1991,"[{'_id': '61e5815bcffb8f2faa4160a7', 'id': 'tt..."
1,Across the Tracks,1991,[]
2,The Addams Family,1991,"[{'_id': '61e5815fe1a8ddbd96416169', 'id': 'tt..."
3,All I Want for Christmas,1991,"[{'_id': '61e5815b909c2ca78141605b', 'id': 'tt..."
4,American Kickboxer,1991,"[{'_id': '61e5815fcffb8f2faa416141', 'id': 'tt..."

In [94]:
#the dataframe has been saved

In [95]:
json_results_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4758 entries, 0 to 4757
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         4758 non-null   object
 1   release_year  4758 non-null   int64
 2   results       4758 non-null   object
dtypes: int64(1), object(2)
memory usage: 111.6+ KB

* And also we can see emplty list [] with no result. let's drop those

In [96]:
json_results_df1 = json_results_df1[json_results_df1['results'].map(len) > 0]
json_results_df1.reset_index(drop=True, inplace=True)

In [97]:
json_results_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3641 entries, 0 to 3640
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         3641 non-null   object
 1   release_year  3641 non-null   int64
 2   results       3641 non-null   object
dtypes: int64(1), object(2)
memory usage: 85.5+ KB

extract imdb_id and poster from results

In [98]:
json_results_df1['results'][1][0]['id']

'tt0101272'

In [99]:
count=0
imdb_id = []
poster = []
for record in range(json_results_df1['results'].shape[0]):
    
    imdb_id.append(json_results_df1['results'][record][0]['id'])
    
    if json_results_df1['results'][record][0]['primaryImage'] is not None:
        poster.append(json_results_df1['results'][record][0]['primaryImage']['url'])
    else:
        poster.append('poster not available')
    count+=1
    #print(record)

In [100]:
len(imdb_id), len(poster)

(3641, 3641)

In [101]:
json_results_df1['imdb_id'] = imdb_id
json_results_df1['poster'] = poster

In [102]:
json_results_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3641 entries, 0 to 3640
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         3641 non-null   object
 1   release_year  3641 non-null   int64
 2   results       3641 non-null   object
 3   imdb_id       3641 non-null   object
 4   poster        3641 non-null   object
dtypes: int64(1), object(4)
memory usage: 142.4+ KB

In [103]:
json_results_df1.drop('results', axis=1, inplace=True)

In [104]:
movies_df1 = json_results_df1.copy()

* The movie database api in rapid api is giving null for cast and crew

Now we need to find tmdb id using imdb id and further we can find cast and crew details using tmdb id

In [107]:
import requests

url = "https://api.themoviedb.org/3/find/tt0103939?external_source=imdb_id"

headers = {
    "accept": "application/json",
    "Authorization": "Bearer eyJhbGciOiJIUzI1NiJ9.eyJhdWQiOiJjYTY0OTg4MmMxZGM2YzIwM2RhNDcxY2ExMDJmY2MxNyIsInN1YiI6IjY0NzczYmFkMTJjNjA0MDEzZWQ5MGFjNyIsInNjb3BlcyI6WyJhcGlfcmVhZCJdLCJ2ZXJzaW9uIjoxfQ.-Saw_BrZ_WDQkMvZ04gfVwwiVR6HSpHO2QiiWAOjYxA"
}

response = requests.get(url, headers=headers)
response.json()

{'movie_results': [{'adult': False,
   'backdrop_path': '/lAaAtQ5b8iX9JeG6QUq4RM1paKD.jpg',
   'id': 10435,
   'title': 'Chaplin',
   'original_language': 'en',
   'original_title': 'Chaplin',
   'overview': "An aged Charlie Chaplin narrates his life to his autobiography's editor, including his rise to wealth and comedic fame from poverty, his turbulent personal life and his run-ins with the FBI.",
   'poster_path': '/Aeltt5tl02zrEj4GoMynHc94lWG.jpg',
   'media_type': 'movie',
   'genre_ids': [18],
   'popularity': 14.605,
   'release_date': '1992-12-17',
   'video': False,
   'vote_average': 7.451,
   'vote_count': 920}],
 'person_results': [],
 'tv_results': [],
 'tv_episode_results': [],
 'tv_season_results': []}

In [112]:
url = "https://api.themoviedb.org/3/find/{}?external_source=imdb_id"

headers = {
    "accept": "application/json",
    "Authorization": "Bearer eyJhbGciOiJIUzI1NiJ9.eyJhdWQiOiJjYTY0OTg4MmMxZGM2YzIwM2RhNDcxY2ExMDJmY2MxNyIsInN1YiI6IjY0NzczYmFkMTJjNjA0MDEzZWQ5MGFjNyIsInNjb3BlcyI6WyJhcGlfcmVhZCJdLCJ2ZXJzaW9uIjoxfQ.-Saw_BrZ_WDQkMvZ04gfVwwiVR6HSpHO2QiiWAOjYxA"
}


def call_apis(session, df, variable):
    tasks = []
    for ids in df[variable].values:
        tasks.append(asyncio.create_task(session.get(url.format(ids), headers=headers)))

    return tasks

async def get_data(df, variable):
    async with aiohttp.ClientSession() as session:
        tasks = call_apis(session, df, variable)
        responses = await asyncio.gather(*tasks)
        json_responses = []
        for response in responses:
            json_response = await response.json()
            json_responses.append(json_response)
         
        
        return json_responses

In [123]:
start = time.time()
# Run the code
#ids, overview = 
json_responses = await get_data(imdb_ids_df, 'imdb_id')

end = time.time()
total_time = end - start
print("It took {} seconds to make {} API calls".format(total_time, len(movies_df1['imdb_id'].values)))
print('You did it!')

It took 27.19379186630249 seconds to make 3640 API calls
You did it!

In [126]:
len(json_responses)

3640

In [127]:
pd.DataFrame(json_responses).isna().sum()   #no nulls

movie_results         0
person_results        0
tv_results            0
tv_episode_results    0
tv_season_results     0
dtype: int64

In [128]:
json_responses[0]['movie_results'][0]#['title']

{'adult': False,
 'backdrop_path': '/xxtG3bsOIWwvOQrdTUcLe7D5adN.jpg',
 'id': 43267,
 'title': '29th Street',
 'original_language': 'en',
 'original_title': '29th Street',
 'overview': 'After winning $6.2 million in the 1976 New York State Lottery, he is arrested for throwing rocks at a church. He then tells his story at the police station.',
 'poster_path': '/qU1OeCyTMeejI81tZkx6VCzp8dP.jpg',
 'media_type': 'movie',
 'genre_ids': [35],
 'popularity': 5.964,
 'release_date': '1991-11-01',
 'video': False,
 'vote_average': 6.9,
 'vote_count': 27}

In [129]:
tmdb_ids = []
titles2 = []
count = 0
for result in range(len(json_responses)):
    if len(json_responses[result]['movie_results']) > 0:
        tmdb_ids.append(json_responses[result]['movie_results'][0]['id'])
        #titles2.append(json_responses[result]['movie_results'][0]['title'])
        
    else:
        tmdb_ids.append('no results')
        #titles2.append('no results')
        
    count+=1

In [130]:
count

3640

In [131]:
NR = 0
for i in tmdb_ids:
    if i == 'no results':
        NR+=1
print(NR)

9

In [133]:
movies_df1['tmdb_id'] = tmdb_ids
#movies_df1['titles2'] = titles2

In [150]:
movies_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3640 entries, 0 to 3639
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         3640 non-null   object
 1   release_year  3640 non-null   int64
 2   results       3640 non-null   object
 3   imdb_id       3640 non-null   object
 4   poster        3640 non-null   object
 5   tmdb_id       3640 non-null   object
dtypes: int64(1), object(5)
memory usage: 170.8+ KB

In [151]:
movies_df1.head()

,Title,release_year,results,imdb_id,poster,tmdb_id
0,29th Street,1991,"[{'_id': '61e5815bcffb8f2faa4160a7', 'id': 'tt...",tt0101252,https://m.media-amazon.com/images/M/MV5BMWY2MT...,43267
1,The Addams Family,1991,"[{'_id': '61e5815fe1a8ddbd96416169', 'id': 'tt...",tt0101272,https://m.media-amazon.com/images/M/MV5BODc1Nm...,2907
2,All I Want for Christmas,1991,"[{'_id': '61e5815b909c2ca78141605b', 'id': 'tt...",tt0101301,https://m.media-amazon.com/images/M/MV5BMTk3Mj...,13644
3,American Kickboxer,1991,"[{'_id': '61e5815fcffb8f2faa416141', 'id': 'tt...",tt0101325,https://m.media-amazon.com/images/M/MV5BM2E2Nm...,110830
4,An American Tail: Fievel Goes West,1991,"[{'_id': '61e5815b8a5a6a599f416073', 'id': 'tt...",tt0101329,https://m.media-amazon.com/images/M/MV5BZmUyOT...,10380

In [170]:
#let's drop results column
movies_df1.drop(['results'], axis=1, inplace=True)

In [173]:
movies_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3640 entries, 0 to 3639
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         3640 non-null   object
 1   release_year  3640 non-null   int64
 2   imdb_id       3640 non-null   object
 3   poster        3640 non-null   object
 4   tmdb_id       3640 non-null   object
dtypes: int64(1), object(4)
memory usage: 142.3+ KB

let's drop rows in which tmdb_id has 'no results'

In [322]:
sum(movies_df1['tmdb_id'] == 'no results')

9

In [328]:
movies_df1.drop(movies_df1[movies_df1['tmdb_id'] == 'no results'].index, axis=0, inplace=True)

Collecting Top Cast and Director Names

In [196]:
url = "https://api.themoviedb.org/3/movie/{}/credits?language=en-US"

headers = {
    "accept": "application/json",
    "Authorization": "Bearer eyJhbGciOiJIUzI1NiJ9.eyJhdWQiOiJjYTY0OTg4MmMxZGM2YzIwM2RhNDcxY2ExMDJmY2MxNyIsInN1YiI6IjY0NzczYmFkMTJjNjA0MDEzZWQ5MGFjNyIsInNjb3BlcyI6WyJhcGlfcmVhZCJdLCJ2ZXJzaW9uIjoxfQ.-Saw_BrZ_WDQkMvZ04gfVwwiVR6HSpHO2QiiWAOjYxA"
}
start = time.time()
# Run the code

count=0
json_responses = []

for ids in movies_df1['tmdb_id']:
    response = requests.get(url.format(ids), headers=headers)
    json_responses.append(response.json())
    count+=1

In [197]:
len(json_responses)

3640

In [210]:
cast_jsondf=pd.DataFrame(json_responses)

In [212]:
cast_jsondf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3640 entries, 0 to 3639
Data columns (total 6 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              3631 non-null   float64
 1   cast            3631 non-null   object
 2   crew            3631 non-null   object
 3   success         9 non-null      object
 4   status_code     9 non-null      float64
 5   status_message  9 non-null      object
dtypes: float64(2), object(4)
memory usage: 170.8+ KB

In [294]:
json_responses[356]

{'success': False,
 'status_code': 34,
 'status_message': 'The resource you requested could not be found.'}

In [296]:
movies_df1.iloc[356]

Title           Topsy and Bunker: The Cat Killers
release_year                                 1992
imdb_id                                 tt0420261
poster                       poster not available
tmdb_id                                no results
Name: 356, dtype: object

In [304]:
cast=[]
director = []
count=0
for record in range(len(json_responses)):
    
    if 'cast' in json_responses[record]:
        if len(json_responses[record]['cast'])>=6:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name'],
                         json_responses[record]['cast'][2]['name'],
                         json_responses[record]['cast'][3]['name'],
                         json_responses[record]['cast'][4]['name'],
                         json_responses[record]['cast'][5]['name']])
            
        elif len(json_responses[record]['cast'])==5:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name'],
                         json_responses[record]['cast'][2]['name'],
                         json_responses[record]['cast'][3]['name'],
                         json_responses[record]['cast'][4]['name']])
            
        elif len(json_responses[record]['cast'])==4:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name'],
                         json_responses[record]['cast'][2]['name'],
                         json_responses[record]['cast'][3]['name']])
            
        elif len(json_responses[record]['cast'])==3:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name'],
                         json_responses[record]['cast'][2]['name']])
            
        elif len(json_responses[record]['cast'])==2:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name']])
            
        elif len(json_responses[record]['cast'])==1:
            cast.append([json_responses[record]['cast'][0]['name']])
            
            
        else:
            cast.append('unknown')
            
    else:
        cast.append('unknown')
            
            
    if 'crew' in json_responses[record]:
        for member in json_responses[record]['crew']:
                if member['job'] == 'Director':
                    director.append(member['name'])
                    break
        else:
            director.append('unknown')
            
    else:
        director.append('unknown')
    count+=1

In [308]:
len(director), len(cast)

(3640, 3640)

In [307]:
movies_df1['director'] = director
movies_df1['cast'] = cast

In [330]:
movies_df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3631 entries, 0 to 3639
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         3631 non-null   object
 1   release_year  3631 non-null   int64
 2   imdb_id       3631 non-null   object
 3   poster        3631 non-null   object
 4   tmdb_id       3631 non-null   object
 5   director      3631 non-null   object
 6   cast          3631 non-null   object
dtypes: int64(1), object(6)
memory usage: 226.9+ KB

Collecting generes and production company names

In [336]:
url = "https://api.themoviedb.org/3/movie/{}?language=en-US"

headers = {
    "accept": "application/json",
    "Authorization": "Bearer eyJhbGciOiJIUzI1NiJ9.eyJhdWQiOiJjYTY0OTg4MmMxZGM2YzIwM2RhNDcxY2ExMDJmY2MxNyIsInN1YiI6IjY0NzczYmFkMTJjNjA0MDEzZWQ5MGFjNyIsInNjb3BlcyI6WyJhcGlfcmVhZCJdLCJ2ZXJzaW9uIjoxfQ.-Saw_BrZ_WDQkMvZ04gfVwwiVR6HSpHO2QiiWAOjYxA"
}

def call_apis(session, df, variable):
    tasks = []
    for ids in df[variable].values:
        tasks.append(asyncio.create_task(session.get(url.format(ids), headers=headers)))

    return tasks

async def get_data(df, variable):
    async with aiohttp.ClientSession() as session:
        tasks = call_apis(session, df, variable)
        responses = await asyncio.gather(*tasks)
        json_responses = []
        for response in responses:
            json_response = await response.json()
            json_responses.append(json_response)
         
        
        return json_responses

In [ ]:
start = time.time()
# Run the code

json_responses = await get_data(movies_df1, 'tmdb_id')

end = time.time()
total_time = end - start
print("It took {} seconds to make {} API calls".format(total_time, len(movies_df1['imdb_id'].values)))
print('You did it!')

In [355]:
json_responses[2129]['genres']#[0]#['name']

[{'id': 80, 'name': 'Crime'},
 {'id': 18, 'name': 'Drama'},
 {'id': 53, 'name': 'Thriller'}]

In [383]:
genres = []
production_companies = []
count=0

for i in range(len(json_responses)):
    
    if len(json_responses[i]) > 1 and 'genres' in json_responses[i]:
        
        genres_temp = []
        for j in range(len(json_responses[i]['genres'])):
            genres_temp.append(json_responses[i]['genres'][j]['name'])
        
        genres.append(genres_temp)
        
    else:
        genres.append('unknown')
        
    count+=1
    
    if len(json_responses[i]) > 1 and 'production_companies' in json_responses[i]:
        
        production_companies_temp = []
        for j in range(len(json_responses[i]['production_companies'])):
            production_companies_temp.append(json_responses[i]['production_companies'][j]['name'])
        
        production_companies.append(production_companies_temp)
        
    else:
        production_companies.append('unknown')

In [390]:
movies_df1['genres_jsons'] = json_responses
movies_df1['genres'] = genres
movies_df1['production_companies'] = production_companies

In [380]:
i=0
for ii in genres:
    if ii == 'unknown':
        i+=1

In [381]:
i

26

In [6]:
movies_df1 = pd.read_csv('movies_df1.csv')

In [7]:
movies_df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3631 entries, 0 to 3630
Data columns (total 10 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Title                 3631 non-null   object
 1   release_year          3631 non-null   int64
 2   imdb_id               3631 non-null   object
 3   poster                3631 non-null   object
 4   tmdb_id               3631 non-null   int64
 5   director              3631 non-null   object
 6   cast                  3631 non-null   object
 7   genres_jsons          3631 non-null   object
 8   genres                3631 non-null   object
 9   production_companies  3631 non-null   object
dtypes: int64(2), object(8)
memory usage: 283.8+ KB

<b>Now let's collect data for movies from year 2010 to 2022 but using some user-defined functions

In [3]:
def get_titles_from_10_to_22(year):
    """ takes year(2010 - 2022) as input and return a dataframe which contains list movies released in the year"""
    
    df = pd.DataFrame()
    url = "https://en.wikipedia.org/wiki/List_of_American_films_of_{}".format(year)
    
    for table in range(2, 6):
        df = pd.concat([df, pd.read_html(url)[table]], ignore_index=True)
        
    df['release_year'] = np.full(shape=df.shape[0], fill_value=year, dtype=int) #adding release year
    
    #make columns names in lower case
    df.columns = list(map(str.lower, df.columns))
    
    return df[['title', 'release_year']]

In [4]:
get_titles_from_10_to_22.__doc__

' takes year(2010 - 2022) as input and return a dataframe which contains list movies released in the year'

In [5]:
#our function is ready let's get the data for year 2010
m2010 = get_titles_from_10_to_22(2010)
m2010.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 352 entries, 0 to 351
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         351 non-null    object
 1   release_year  352 non-null    int32
dtypes: int32(1), object(1)
memory usage: 4.2+ KB

In [6]:
m2010.head()

                                            title  release_year
0  Winter Day Dreams ft. Franny's Feet and Olivia          2010
1                                  Garbage Dreams          2010
2                                      Sweetgrass          2010
3                                     Daybreakers          2010
4                                       Leap Year          2010

In [7]:
#2011
m2011 = get_titles_from_10_to_22(2011)
m2011.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         214 non-null    object
 1   release_year  214 non-null    int32
dtypes: int32(1), object(1)
memory usage: 2.6+ KB

In [8]:
m2011.head()

                              title  release_year
0   If I Want to Whistle, I Whistle          2011
1  Phil Ochs: There but for Fortune          2011
2               Season of the Witch          2011
3             The Time That Remains          2011
4                  Barney's Version          2011

In [9]:
#2012
m2012 = get_titles_from_10_to_22(2012)
m2012.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 282 entries, 0 to 281
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         282 non-null    object
 1   release_year  282 non-null    int32
dtypes: int32(1), object(1)
memory usage: 3.4+ KB

In [10]:
m2012.head()

                  title  release_year
0      The Devil Inside          2012
1  Beneath the Darkness          2012
2        Norwegian Wood          2012
3            Contraband          2012
4          Joyful Noise          2012

In [11]:
#2013
m2013 = get_titles_from_10_to_22(2013)
m2013.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 286 entries, 0 to 285
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         285 non-null    object
 1   release_year  286 non-null    int32
dtypes: int32(1), object(1)
memory usage: 3.5+ KB

In [12]:
m2013.head()

               title  release_year
0         Crawlspace          2013
1       A Dark Truth          2013
2       Table No. 21          2013
3  Texas Chainsaw 3D          2013
4    The Grandmaster          2013

In [13]:
#2014
m2014 = get_titles_from_10_to_22(2014)
m2014.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 231 entries, 0 to 230
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         229 non-null    object
 1   release_year  231 non-null    int32
dtypes: int32(1), object(1)
memory usage: 2.8+ KB

In [14]:
m2014.head()

                                  title  release_year
0  Paranormal Activity: The Marked Ones          2014
1                            Open Grave          2014
2                  Cold Comes the Night          2014
3                             Dumbbells          2014
4                The Legend of Hercules          2014

In [15]:
#2015
m2015 = get_titles_from_10_to_22(2015)
m2015.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 211 entries, 0 to 210
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         209 non-null    object
 1   release_year  211 non-null    int32
dtypes: int32(1), object(1)
memory usage: 2.6+ KB

In [16]:
m2015.head()

                                title  release_year
0  The Woman in Black: Angel of Death          2015
1                             Taken 3          2015
2              Let's Kill Ward's Wife          2015
3                               Match          2015
4                            Blackhat          2015

In [17]:
#2016
m2016 = get_titles_from_10_to_22(2016)
m2016.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 185 entries, 0 to 184
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         183 non-null    object
 1   release_year  185 non-null    int32
dtypes: int32(1), object(1)
memory usage: 2.3+ KB

In [18]:
m2016.head()

                                       title  release_year
0                                 The Forest          2016
1                                 Anesthesia          2016
2                                       Lamb          2016
3                               Ride Along 2          2016
4  13 Hours: The Secret Soldiers of Benghazi          2016

In [19]:
#2017
m2017 = get_titles_from_10_to_22(2017)
m2017.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 247 entries, 0 to 246
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         247 non-null    object
 1   release_year  247 non-null    int32
dtypes: int32(1), object(1)
memory usage: 3.0+ KB

In [20]:
m2017.head()

                    title  release_year
0  Underworld: Blood Wars          2017
1                 Arsenal          2017
2              Between Us          2017
3          Monster Trucks          2017
4         The Bye Bye Man          2017

In [21]:
#2018
m2018 = get_titles_from_10_to_22(2018)
m2018.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 275 entries, 0 to 274
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         275 non-null    object
 1   release_year  275 non-null    int32
dtypes: int32(1), object(1)
memory usage: 3.3+ KB

In [22]:
m2018.head()

                     title  release_year
0  Insidious: The Last Key          2018
1         The Strange Ones          2018
2                 Stratton          2018
3            Sweet Country          2018
4             The Commuter          2018

In [23]:
#2019
m2019 = get_titles_from_10_to_22(2019)
m2019.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 245 entries, 0 to 244
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         245 non-null    object
 1   release_year  245 non-null    int32
dtypes: int32(1), object(1)
memory usage: 3.0+ KB

In [24]:
m2019.head()

              title  release_year
0       Escape Room          2019
1        Rust Creek          2019
2  American Hangman          2019
3  A Dog's Way Home          2019
4        The Upside          2019

In [25]:
#2020
m2020 = get_titles_from_10_to_22(2020)
m2020.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 275 entries, 0 to 274
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         275 non-null    object
 1   release_year  275 non-null    int32
dtypes: int32(1), object(1)
memory usage: 3.3+ KB

In [26]:
m2020.head()

               title  release_year
0         The Grudge          2020
1         Underwater          2020
2        Like a Boss          2020
3      Three Christs          2020
4  Inherit the Viper          2020

In [27]:
#2021
m2021 = get_titles_from_10_to_22(2021)
m2021.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 361 entries, 0 to 360
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         360 non-null    object
 1   release_year  361 non-null    int32
dtypes: int32(1), object(1)
memory usage: 4.4+ KB

In [28]:
m2021.head()

                 title  release_year
0  Shadow in the Cloud          2021
1      The White Tiger          2021
2          Locked Down          2021
3              The Dig          2021
4     Outside the Wire          2021

In [29]:
#2022
m2022 = get_titles_from_10_to_22(2022)
m2022.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 329 entries, 0 to 328
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         325 non-null    object
 1   release_year  329 non-null    int32
dtypes: int32(1), object(1)
memory usage: 4.0+ KB

In [30]:
m2022.head()

                      title  release_year
0                   The 355          2022
1  The Legend of La Llorona          2022
2              The Commando          2022
3            American Siege          2022
4                    Scream          2022

let's concat titles of all movies from 2010 t0 2022 to make one dataframe: titles_df2

In [31]:
titles_df2 = pd.concat([m2010, m2011, m2012, m2013, m2014, m2015, m2016, m2017, m2018, m2019, m2020, m2021, m2022], ignore_index=True)

In [32]:
titles_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3493 entries, 0 to 3492
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         3480 non-null   object
 1   release_year  3493 non-null   int32
dtypes: int32(1), object(1)
memory usage: 41.1+ KB

In [33]:
titles_df2.head()

                                            title  release_year
0  Winter Day Dreams ft. Franny's Feet and Olivia          2010
1                                  Garbage Dreams          2010
2                                      Sweetgrass          2010
3                                     Daybreakers          2010
4                                       Leap Year          2010

In [34]:
titles_df2.tail()

               title  release_year
3488  Alice, Darling          2022
3489             NaN          2022
3490             NaN          2022
3491             NaN          2022
3492             NaN          2022

In [35]:
# dropping null values
titles_df2.dropna(axis=0, inplace=True)
titles_df2.reset_index(drop=True,inplace=True)

In [36]:
titles_df2.isna().sum()

title           0
release_year    0
dtype: int64

In [38]:
titles_df2.sample(10)

                                title  release_year
2545                         Downhill          2020
491   Bucky Larson: Born to Be a Star          2011
118                  Mother and Child          2010
2480                Playing with Fire          2019
2695                      The Glorias          2020
2188                   White Boy Rick          2018
499                             Setup          2011
2980                 The Green Knight          2021
2222         Can You Ever Forgive Me?          2018
207                       Spoken Word          2010

collect imdb id and poster from themoviedatabase api from rapid api website

In [19]:
def call_apis(session, df):
    tasks = []
    
    for i in range(df.shape[0]):
        url = "https://moviesdatabase.p.rapidapi.com/titles/search/title/{}"
        querystring = {"exact":"true","year":"{}".format(df.iloc[i]['release_year']),"titleType":"movie"}
        headers = {
            "X-RapidAPI-Key": "ef44d30bedmsh7d2930aa0e90321p11240djsnf550adfe0503",
            "X-RapidAPI-Host": "moviesdatabase.p.rapidapi.com"
            }
        
        tasks.append(asyncio.create_task(session.get(url.format(df.iloc[i]['title']), headers=headers, params=querystring)))

    return tasks

async def get_data(df):
    """ It gives ids, titles, overview, genre_ids, popularity, vote_average, vote_count"""
    async with aiohttp.ClientSession() as session:
        tasks = call_apis(session, df)
        responses = await asyncio.gather(*tasks)
        json_responses = []
        for response in responses:
            json_response = await response.json()
            json_responses.append(json_response)
    
        return json_responses

In [40]:
json_responses1 = await get_data(titles_df2)

In [41]:
pd.DataFrame(json_responses1)['results'].isna().sum()

12

In [57]:
def get_imdbid_poster(df, jsons):
    
    jsons = pd.DataFrame(jsons)
    #concated
    df['results'] = jsons['results']
    
    #dropping Na
    df.dropna(inplace=True)
    df.reset_index(drop=True, inplace=True)
    
    #removing rows with empty lists '[]' in results
    df = df[df['results'].map(len) > 0]
    df.reset_index(drop=True, inplace=True)
    
    
    count=0
    imdb_id = []
    poster = []
    for record in range(df['results'].shape[0]):
    
        imdb_id.append(df['results'][record][0]['id'])
    
        if df['results'][record][0]['primaryImage'] is not None:
            poster.append(df['results'][record][0]['primaryImage']['url'])
        else:
            poster.append('poster not available')
        count+=1
        
    df.loc[:,'imdb_id'] = imdb_id
    df.loc[:,'poster'] = poster
    
    return df[['title', 'release_year', 'imdb_id', 'poster']]

In [64]:
movies_df2 = get_imdbid_poster(titles_df2, json_responses1) #storing into movies_df2

In [65]:
movies_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2527 entries, 0 to 2526
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         2527 non-null   object
 1   release_year  2527 non-null   int32
 2   imdb_id       2527 non-null   object
 3   poster        2527 non-null   object
dtypes: int32(1), object(3)
memory usage: 69.2+ KB

In [90]:
movies_df2.reset_index(drop=True, inplace=True)

In [4]:
movies_df2 = pd.read_csv('imdb_ids_df2.csv')
movies_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2531 entries, 0 to 2530
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         2531 non-null   object
 1   release_year  2531 non-null   int64
 2   imdb_id       2531 non-null   object
 3   poster        2531 non-null   object
dtypes: int64(1), object(3)
memory usage: 79.2+ KB

getting tmdb id using imdb id

In [2]:
url = "https://api.themoviedb.org/3/find/{}?external_source=imdb_id"

headers = {
    "accept": "application/json",
    "Authorization": "Bearer eyJhbGciOiJIUzI1NiJ9.eyJhdWQiOiJjYTY0OTg4MmMxZGM2YzIwM2RhNDcxY2ExMDJmY2MxNyIsInN1YiI6IjY0NzczYmFkMTJjNjA0MDEzZWQ5MGFjNyIsInNjb3BlcyI6WyJhcGlfcmVhZCJdLCJ2ZXJzaW9uIjoxfQ.-Saw_BrZ_WDQkMvZ04gfVwwiVR6HSpHO2QiiWAOjYxA"
}


def call_apis(session, df, variable):
    tasks = []
    for ids in df[variable].values:
        tasks.append(asyncio.create_task(session.get(url.format(ids), headers=headers)))

    return tasks

async def get_data(df, variable):
    async with aiohttp.ClientSession() as session:
        tasks = call_apis(session, df, variable)
        responses = await asyncio.gather(*tasks)
        json_responses = []
        for response in responses:
            json_response = await response.json()
            json_responses.append(json_response)
         
        
        return json_responses

In [7]:
start = time.time()
# Run the code
#ids, overview = 
json_responses2 = await get_data(movies_df2, 'imdb_id')

end = time.time()
total_time = end - start
print("It took {} seconds to make {} API calls".format(total_time, len(movies_df2['imdb_id'].values)))
print('You did it!')

It took 5.628038167953491 seconds to make 2531 API calls
You did it!

In [8]:
pd.DataFrame(json_responses2)['movie_results'][pd.DataFrame(json_responses2)['movie_results'].isna()]#.sum()

Series([], Name: movie_results, dtype: object)

In [9]:
tmdb_ids = []
titles2 = []
count = 0
for result in range(len(json_responses2)):
    if len(json_responses2[result]['movie_results']) > 0:
        tmdb_ids.append(json_responses2[result]['movie_results'][0]['id'])
        #titles2.append(json_responses[result]['movie_results'][0]['title'])
        
    else:
        tmdb_ids.append('no results')
        #titles2.append('no results')
        
    count+=1

In [11]:
movies_df2['tmdb_id'] = tmdb_ids

In [12]:
movies_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2531 entries, 0 to 2530
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         2531 non-null   object
 1   release_year  2531 non-null   int64
 2   imdb_id       2531 non-null   object
 3   poster        2531 non-null   object
 4   tmdb_id       2531 non-null   object
dtypes: int64(1), object(4)
memory usage: 99.0+ KB

In [13]:
#droppping rows with 'no results' in tmdb_id
movies_df2.drop(movies_df2[movies_df2['tmdb_id'] == 'no results'].index, axis=0, inplace=True)

In [15]:
movies_df2.reset_index(drop=True, inplace=True)

In [16]:
movies_df2.shape

(2515, 5)

In [17]:
movies_df2.head()

,title,release_year,imdb_id,poster,tmdb_id
0,Leap Year,2010,tt1216492,https://m.media-amazon.com/images/M/MV5BMTgzMT...,25195
1,Crazy on the Outside,2010,tt1196134,https://m.media-amazon.com/images/M/MV5BMTgzMj...,35458
2,Wonderful World,2010,tt6622356,https://m.media-amazon.com/images/M/MV5BY2EwMW...,451573
3,The Book of Eli,2010,tt1037705,https://m.media-amazon.com/images/M/MV5BNTE1OW...,20504
4,The Spy Next Door,2010,tt1273678,https://m.media-amazon.com/images/M/MV5BMTI5Mj...,23172

In [18]:
movies_df2.tail()

,title,release_year,imdb_id,poster,tmdb_id
2510,The Whale,2022,tt11909878,https://m.media-amazon.com/images/M/MV5BODcxYz...,642885
2511,5000 Blankets,2022,tt4595186,https://m.media-amazon.com/images/M/MV5BNzJlMT...,799546
2512,The Pale Blue Eye,2022,tt12908110,https://m.media-amazon.com/images/M/MV5BMmY3NG...,723419
2513,A Man Called Otto,2022,tt14668630,https://m.media-amazon.com/images/M/MV5BNmE1MT...,830784
2514,"Alice, Darling",2022,tt10304142,https://m.media-amazon.com/images/M/MV5BNDQwNz...,664469

In [19]:
#movies_df2.to_csv('imdb_ids_df2.csv')

Getting top cast and director names

In [ ]:
import requests

url = "https://api.themoviedb.org/3/movie/642885/credits?language=en-US"

headers = {
    "accept": "application/json",
    "Authorization": "Bearer eyJhbGciOiJIUzI1NiJ9.eyJhdWQiOiJjYTY0OTg4MmMxZGM2YzIwM2RhNDcxY2ExMDJmY2MxNyIsInN1YiI6IjY0NzczYmFkMTJjNjA0MDEzZWQ5MGFjNyIsInNjb3BlcyI6WyJhcGlfcmVhZCJdLCJ2ZXJzaW9uIjoxfQ.-Saw_BrZ_WDQkMvZ04gfVwwiVR6HSpHO2QiiWAOjYxA"
}

response = requests.get(url, headers=headers)

print(response.text)

In [43]:
json_responses = []

In [44]:
url = "https://api.themoviedb.org/3/movie/{}/credits?language=en-US"

headers = {
    "accept": "application/json",
    "Authorization": "Bearer eyJhbGciOiJIUzI1NiJ9.eyJhdWQiOiJjYTY0OTg4MmMxZGM2YzIwM2RhNDcxY2ExMDJmY2MxNyIsInN1YiI6IjY0NzczYmFkMTJjNjA0MDEzZWQ5MGFjNyIsInNjb3BlcyI6WyJhcGlfcmVhZCJdLCJ2ZXJzaW9uIjoxfQ.-Saw_BrZ_WDQkMvZ04gfVwwiVR6HSpHO2QiiWAOjYxA"
}
start = time.time()
# Run the code

count=0
#json_responses = []

for ids in movies_df2['tmdb_id']:
    response = requests.get(url.format(ids), headers=headers, stream=True)
    json_responses.append(response.json())
    count+=1

In [45]:
len(json_responses)

2515

In [46]:
json_responses[0]

{'id': 25195,
 'cast': [{'adult': False,
   'gender': 1,
   'id': 9273,
   'known_for_department': 'Acting',
   'name': 'Amy Adams',
   'original_name': 'Amy Adams',
   'popularity': 35.737,
   'profile_path': '/1h2r2VTpoFb5QefAaBYYQgQzL9z.jpg',
   'cast_id': 1,
   'character': 'Anna Brady',
   'credit_id': '52fe44bdc3a368484e034121',
   'order': 0},
  {'adult': False,
   'gender': 2,
   'id': 1247,
   'known_for_department': 'Acting',
   'name': 'Matthew Goode',
   'original_name': 'Matthew Goode',
   'popularity': 19.018,
   'profile_path': '/3XaKKl0bKswTWbJ0Lh9nZ4UdAQo.jpg',
   'cast_id': 2,
   'character': 'Declan',
   'credit_id': '52fe44bdc3a368484e034125',
   'order': 1},
  {'adult': False,
   'gender': 2,
   'id': 12074,
   'known_for_department': 'Acting',
   'name': 'John Lithgow',
   'original_name': 'John Lithgow',
   'popularity': 18.334,
   'profile_path': '/wy472oAFCxkSq5c015wjql532Yj.jpg',
   'cast_id': 7,
   'character': 'Jack Brady',
   'credit_id': '52fe44bdc3a368484e03413f',
   'order': 2},
  {'adult': False,
   'gender': 1,
   'id': 176188,
   'known_for_department': 'Acting',
   'name': 'Flaminia Cinque',
   'original_name': 'Flaminia Cinque',
   'popularity': 3.685,
   'profile_path': '/em5rya2juvKbPohdeZ3f0P86mU9.jpg',
   'cast_id': 8,
   'character': 'Carla',
   'credit_id': '52fe44bdc3a368484e034143',
   'order': 3},
  {'adult': False,
   'gender': 2,
   'id': 44930,
   'known_for_department': 'Acting',
   'name': 'Tony Rohr',
   'original_name': 'Tony Rohr',
   'popularity': 3.309,
   'profile_path': '/2V6AfI2kMByyOMkTNaHfI5On5x5.jpg',
   'cast_id': 9,
   'character': 'Frank',
   'credit_id': '52fe44bdc3a368484e034147',
   'order': 4},
  {'adult': False,
   'gender': 2,
   'id': 188468,
   'known_for_department': 'Acting',
   'name': 'Pat Laffan',
   'original_name': 'Pat Laffan',
   'popularity': 3.842,
   'profile_path': '/eBXRV2pCg0WThbyGUqAU0tpx2ob.jpg',
   'cast_id': 10,
   'character': 'Donal',
   'credit_id': '52fe44bdc3a368484e03414b',
   'order': 5},
  {'adult': False,
   'gender': 1,
   'id': 115146,
   'known_for_department': 'Acting',
   'name': 'Dominique McElligott',
   'original_name': 'Dominique McElligott',
   'popularity': 25.152,
   'profile_path': '/pA6jcdqj05YQEVukE81a1hWx4NA.jpg',
   'cast_id': 12,
   'character': 'Bride',
   'credit_id': '52fe44bdc3a368484e034153',
   'order': 6},
  {'adult': False,
   'gender': 2,
   'id': 43138,
   'known_for_department': 'Acting',
   'name': 'Ian McElhinney',
   'original_name': 'Ian McElhinney',
   'popularity': 10.087,
   'profile_path': '/xkKicrls0SEYP3kAaKhyWnd395S.jpg',
   'cast_id': 11,
   'character': 'Priest',
   'credit_id': '52fe44bdc3a368484e03414f',
   'order': 7},
  {'adult': False,
   'gender': 2,
   'id': 36801,
   'known_for_department': 'Acting',
   'name': 'Adam Scott',
   'original_name': 'Adam Scott',
   'popularity': 16.959,
   'profile_path': '/b82C29R6fGiPoqIglQ4lzS6q2YX.jpg',
   'cast_id': 6,
   'character': 'Jeremy',
   'credit_id': '52fe44bdc3a368484e03413b',
   'order': 8},
  {'adult': False,
   'gender': 1,
   'id': 95102,
   'known_for_department': 'Acting',
   'name': 'Kaitlin Olson',
   'original_name': 'Kaitlin Olson',
   'popularity': 26.092,
   'profile_path': '/z84SKRCVl9zPhP9AINVS8Bx8dRO.jpg',
   'cast_id': 13,
   'character': 'Libby',
   'credit_id': '52fe44bdc3a368484e034157',
   'order': 9},
  {'adult': False,
   'gender': 2,
   'id': 86442,
   'known_for_department': 'Acting',
   'name': 'Michael J. Reynolds',
   'original_name': 'Michael J. Reynolds',
   'popularity': 4.271,
   'profile_path': '/4fjOXTU96Hlv2gHNqlXt19SJaPW.jpg',
   'cast_id': 14,
   'character': 'Jerome',
   'credit_id': '52fe44bdc3a368484e03415b',
   'order': 10},
  {'adult': False,
   'gender': 2,
   'id': 1057048,
   'known_for_department': 'Acting',
   'name': 'Michael Ford-FitzGerald',
   'original_name': 'Michael Ford-FitzGerald',
   'popularity': 0.988,
   'profile_path': '/wlgL5NXPElo4JTRo1QxnBijM6GY.jpg',
   'cast_id': 15,
   'character': 'Fergus',
   'credit_id': '52fe44bdc3a368484e03415f',
   'order': 11},
  {'adult': False,
   'gender': 2,
   'id': 24595,
   'known_for_department': 'Acting',
   'name': 'Vincenzo Nicoli',
   'original_name': 'Vincenzo Nicoli',
   'popularity': 2.148,
   'profile_path': None,
   'cast_id': 16,
   'character': 'Stefano',
   'credit_id': '52fe44bdc3a368484e034163',
   'order': 12},
  {'adult': False,
   'gender': 1,
   'id': 1212145,
   'known_for_department': 'Acting',
   'name': 'Marcia Warren',
   'original_name': 'Marcia Warren',
   'popularity': 2.229,
   'profile_path': '/nhpbQcoogi3uAdgmOW9A0FqdIxz.jpg',
   'cast_id': 17,
   'character': 'Adele',
   'credit_id': '52fe44bdc3a368484e034167',
   'order': 13},
  {'adult': False,
   'gender': 2,
   'id': 150584,
   'known_for_department': 'Acting',
   'name': "Noel O'Donovan",
   'original_name': "Noel O'Donovan",
   'popularity': 0.98,
   'profile_path': '/i7VJjVklFhOah8pWuCHljsxCnKf.jpg',
   'cast_id': 23,
   'character': 'Seamus',
   'credit_id': '5b77328992514156ed001e4d',
   'order': 14},
  {'adult': False,
   'gender': 2,
   'id': 43139,
   'known_for_department': 'Acting',
   'name': 'Alan Devlin',
   'original_name': 'Alan Devlin',
   'popularity': 1.151,
   'profile_path': '/8FxmNUUdgPlRpjEMk8adZYiGH7s.jpg',
   'cast_id': 24,
   'character': 'Joe',
   'credit_id': '5b7733b5c3a3681beb002f1a',
   'order': 15},
  {'adult': False,
   'gender': 2,
   'id': 1227302,
   'known_for_department': 'Acting',
   'name': "Mark O'Regan",
   'original_name': "Mark O'Regan",
   'popularity': 0.6,
   'profile_path': '/uqayk2p6zZkDQuhouyxJslmkaAj.jpg',
   'cast_id': 25,
   'character': 'Captain',
   'credit_id': '5b77343992514157030022d5',
   'order': 16},
  {'adult': False,
   'gender': 1,
   'id': 1233838,
   'known_for_department': 'Acting',
   'name': 'Maggie McCarthy',
   'original_name': 'Maggie McCarthy',
   'popularity': 2.012,
   'profile_path': '/n1zXalKbjq9qKfsr3L30auvmk0z.jpg',
   'cast_id': 26,
   'character': 'Eileen',
   'credit_id': '5b7734b50e0a2604580025c7',
   'order': 17},
  {'adult': False,
   'gender': 2,
   'id': 59715,
   'known_for_department': 'Acting',
   'name': "Peter O'Meara",
   'original_name': "Peter O'Meara",
   'popularity': 4.328,
   'profile_path': '/v4AlrudoxQk6tJ2YWhsH3t1euq6.jpg',
   'cast_id': 27,
   'character': 'Ron',
   'credit_id': '5b77351b92514156f2002487',
   'order': 18},
  {'adult': False,
   'gender': 2,
   'id': 2109764,
   'known_for_department': 'Acting',
   'name': 'Pat Deery',
   'original_name': 'Pat Deery',
   'popularity': 0.6,
   'profile_path': '/1352IySODmDRrXDktZmAQsxzm2I.jpg',
   'cast_id': 28,
   'character': 'Sozzled Regular 1',
   'credit_id': '5b7735de0e0a26046e0027c1',
   'order': 19},
  {'adult': False,
   'gender': 2,
   'id': 1583206,
   'known_for_department': 'Acting',
   'name': 'John Burke',
   'original_name': 'John Burke',
   'popularity': 1.4,
   'profile_path': '/w0Wjfe4eZxe79rpK8thE8rTw3m1.jpg',
   'cast_id': 18,
   'character': 'Sozzled Regular 2',
   'credit_id': '56eda3ff9251414dba005d06',
   'order': 20},
  {'adult': False,
   'gender': 2,
   'id': 1239704,
   'known_for_department': 'Acting',
   'name': 'Macdara Ó Fátharta',
   'original_name': 'Macdara Ó Fátharta',
   'popularity': 2.295,
   'profile_path': '/rA7oJWKTMXT4Ej8yZV5Mczw1xE9.jpg',
   'cast_id': 29,
   'character': 'Father Malone',
   'credit_id': '5b7737f70e0a260466002cd6',
   'order': 21},
  {'adult': False,
   'gender': 1,
   'id': 232941,
   'known_for_department': 'Acting',
   'name': 'Catherine Walker',
   'original_name': 'Catherine Walker',
   'popularity': 8.042,
   'profile_path': '/cL1Ig5XUnGS6qaaNRNiliqAUvkz.jpg',
   'cast_id': 30,
   'character': 'Kaleigh',
   'credit_id': '5b773945925141294e00001a',
   'order': 22},
  {'adult': False,
   'gender': 2,
   'id': 203581,
   'known_for_department': 'Acting',
   'name': 'Ben Caplan',
   'original_name': 'Ben Caplan',
   'popularity': 2.435,
   'profile_path': '/vYPuTXPfHccKSdjAOPp7FBE3wqm.jpg',
   'cast_id': 31,
   'character': 'Realtor',
   'credit_id': '5b7739a3925141295b00008b',
   'order': 23},
  {'adult': False,
   'gender': 1,
   'id': 192868,
   'known_for_department': 'Acting',
   'name': 'Mali Harries',
   'original_name': 'Mali Harries',
   'popularity': 5.132,
   'profile_path': '/vcy21OpH2dQrh6gigKdSxFMx0Ta.jpg',
   'cast_id': 32,
   'character': 'Gaelic Air Rep 1',
   'credit_id': '5b7739c8925141294c00006e',
   'order': 24},
  {'adult': False,
   'gender': 1,
   'id': 62961,
   'known_for_department': 'Acting',
   'name': 'Sarah Hadland',
   'original_name': 'Sarah Hadland',
   'popularity': 5.422,
   'profile_path': '/aVEhNxCplkThxE2flILB3YOoVPp.jpg',
   'cast_id': 33,
   'character': 'Gaelic Air Rep 2',
   'credit_id': '5b7739dc0e0a2647310000a2',
   'order': 25},
  {'adult': False,
   'gender': 2,
   'id': 1393548,
   'known_for_department': 'Acting',
   'name': 'Breffni McKenna',
   'original_name': 'Breffni McKenna',
   'popularity': 1.702,
   'profile_path': '/eaF7zfUfINdTuZeLL0Rk60THRBu.jpg',
   'cast_id': 34,
   'character': 'Tommo',
   'credit_id': '5b773a750e0a26472e0000f0',
   'order': 26},
  {'adult': False,
   'gender': 0,
   'id': 204807,
   'known_for_department': 'Acting',
   'name': 'David Fynn',
   'original_name': 'David Fynn',
   'popularity': 3.084,
   'profile_path': '/oYdxEyUugBx2V25gs52DVvlx7th.jpg',
   'cast_id': 35,
   'character': 'Agent',
   'credit_id': '5b773aad0e0a26472e000120',
   'order': 27}],
 'crew': [{'adult': False,
   'gender': 2,
   'id': 298,
   'known_for_department': 'Production',
   'name': 'Chris Bender',
   'original_name': 'Chris Bender',
   'popularity': 3.167,
   'profile_path': '/xTwQ8Jah9BTemz5YFLEIch92eBQ.jpg',
   'credit_id': '5e8c95bbad87f700176aee34',
   'department': 'Production',
   'job': 'Producer'},
  {'adult': False,
   'gender': 2,
   'id': 3310,
   'known_for_department': 'Editing',
   'name': 'Nick Moore',
   'original_name': 'Nick Moore',
   'popularity': 2.774,
   'profile_path': None,
   'credit_id': '5a9a08109251412851014add',
   'department': 'Editing',
   'job': 'Editor'},
  {'adult': False,
   'gender': 2,
   'id': 4504,
   'known_for_department': 'Production',
   'name': 'Roger Birnbaum',
   'original_name': 'Roger Birnbaum',
   'popularity': 1.919,
   'profile_path': None,
   'credit_id': '5e8c95c6ad87f700176aee44',
   'department': 'Production',
   'job': 'Producer'},
  {'adult': False,
   'gender': 2,
   'id': 4507,
   'known_for_department': 'Production',
   'name': 'Gary Barber',
   'original_name': 'Gary Barber',
   'popularity': 2.447,
   'profile_path': '/5hl0IF9xGyWojIQj0kMrWh88BNw.jpg',
   'credit_id': '5e8c95a54b0c633ca72c705f',
   'department': 'Production',
   'job': 'Producer'},
  {'adult': False,
   'gender': 1,
   'id': 6625,
   'known_for_department': 'Production',
   'name': 'Su Armstrong',
   'original_name': 'Su Armstrong',
   'popularity': 0.828,
   'profile_path': None,
   'credit_id': '5e8c95b010561100168609f5',
   'department': 'Production',
   'job': 'Executive Producer'},
  {'adult': False,
   'gender': 2,
   'id': 9040,
   'known_for_department': 'Camera',
   'name': 'Newton Thomas Sigel',
   'original_name': 'Newton Thomas Sigel',
   'popularity': 5.427,
   'profile_path': '/mTauZZzOY0fhpNkNjeOeDHDk8xm.jpg',
   'credit_id': '5ded824d32489b0012c24640',
   'department': 'Camera',
   'job': 'Director of Photography'},
  {'adult': False,
   'gender': 0,
   'id': 9417,
   'known_for_department': 'Sound',
   'name': 'Javier Bennassar',
   'original_name': 'Javier Bennassar',
   'popularity': 1.96,
   'profile_path': None,
   'credit_id': '5e8c96623a340b001203e5dd',
   'department': 'Sound',
   'job': 'Sound Effects Editor'},
  {'adult': False,
   'gender': 0,
   'id': 15878,
   'known_for_department': 'Art',
   'name': 'Anna Rackard',
   'original_name': 'Anna Rackard',
   'popularity': 0.98,
   'profile_path': None,
   'credit_id': '5e8c96294b0c633ca72c7112',
   'department': 'Art',
   'job': 'Art Direction'},
  {'adult': False,
   'gender': 2,
   'id': 14712,
   'known_for_department': 'Sound',
   'name': 'Randy Edelman',
   'original_name': 'Randy Edelman',
   'popularity': 2.955,
   'profile_path': '/84aXTzWZX2BSYfGcjBrBDyy0euF.jpg',
   'credit_id': '5e8c95fe3a340b001603e16d',
   'department': 'Sound',
   'job': 'Music'},
  {'adult': False,
   'gender': 1,
   'id': 13614,
   'known_for_department': 'Writing',
   'name': 'Deborah Kaplan',
   'original_name': 'Deborah Kaplan',
   'popularity': 3.304,
   'profile_path': '/pP1MNYEN0H7T2rGWpERNQCRtzxV.jpg',
   'credit_id': '52fe44bdc3a368484e034131',
   'department': 'Writing',
   'job': 'Writer'},
  {'adult': False,
   'gender': 2,
   'id': 13615,
   'known_for_department': 'Writing',
   'name': 'Harry Elfont',
   'original_name': 'Harry Elfont',
   'popularity': 3.598,
   'profile_path': '/gr7G7QzUqR8176FefmRC78g4DXK.jpg',
   'credit_id': '52fe44bdc3a368484e034137',
   'department': 'Writing',
   'job': 'Writer'},
  {'adult': False,
   'gender': 2,
   'id': 20223,
   'known_for_department': 'Production',
   'name': 'J.C. Spink',
   'original_name': 'J.C. Spink',
   'popularity': 0.6,
   'profile_path': '/miBxApg7ak57xeeoK8fE1K5vCXN.jpg',
   'credit_id': '5e8c95e53a340b001203e51a',
   'department': 'Production',
   'job': 'Executive Producer'},
  {'adult': False,
   'gender': 2,
   'id': 56765,
   'known_for_department': 'Sound',
   'name': 'Leslie Shatz',
   'original_name': 'Leslie Shatz',
   'popularity': 2.001,
   'profile_path': '/AqIGhoQ8OzFm9mkAQLhaOBkYZYU.jpg',
   'credit_id': '5e8c96a563e6fb0012850860',
   'department': 'Sound',
   'job': 'Sound Designer'},
  {'adult': False,
   'gender': 2,
   'id': 21635,
   'known_for_department': 'Production',
   'name': 'Jonathan Glickman',
   'original_name': 'Jonathan Glickman',
   'popularity': 1.415,
   'profile_path': None,
   'credit_id': '5e8c95d93a340b001203e50e',
   'department': 'Production',
   'job': 'Producer'},
  {'adult': False,
   'gender': 1,
   'id': 26143,
   'known_for_department': 'Art',
   'name': "Irene O'Brien",
   'original_name': "Irene O'Brien",
   'popularity': 1.62,
   'profile_path': None,
   'credit_id': '5e8c961f4b0c633ca72c710b',
   'department': 'Art',
   'job': 'Art Direction'},
  {'adult': False,
   'gender': 2,
   'id': 26481,
   'known_for_department': 'Directing',
   'name': 'Anand Tucker',
   'original_name': 'Anand Tucker',
   'popularity': 3.836,
   'profile_path': '/mmR4URdOgo21p3VDzUb63PrtwWD.jpg',
   'credit_id': '52fe44bdc3a368484e03412b',
   'department': 'Directing',
   'job': 'Director'},
  {'adult': False,
   'gender': 2,
   'id': 43625,
   'known_for_department': 'Art',
   'name': 'Mark Geraghty',
   'original_name': 'Mark Geraghty',
   'popularity': 1.614,
   'profile_path': None,
   'credit_id': '5e8c960b4b0c633d962c8f3a',
   'department': 'Art',
   'job': 'Production Design'},
  {'adult': False,
   'gender': 1,
   'id': 43154,
   'known_for_department': 'Costume & Make-Up',
   'name': 'Eimer Ní Mhaoldomhnaigh',
   'original_name': 'Eimer Ní Mhaoldomhnaigh',
   'popularity': 0.98,
   'profile_path': None,
   'credit_id': '5e8c963e63e6fb0014850cff',
   'department': 'Costume & Make-Up',
   'job': 'Costume Design'},
  {'adult': False,
   'gender': 2,
   'id': 62241,
   'known_for_department': 'Production',
   'name': 'Jake Weiner',
   'original_name': 'Jake Weiner',
   'popularity': 1.4,
   'profile_path': '/jo8DXL0RlSpuiDgYa2mLFKpps99.jpg',
   'credit_id': '5e8c95f13a340b001203e526',
   'department': 'Production',
   'job': 'Producer'},
  {'adult': False,
   'gender': 2,
   'id': 953724,
   'known_for_department': 'Production',
   'name': "Morgan O'Sullivan",
   'original_name': "Morgan O'Sullivan",
   'popularity': 1.96,
   'profile_path': '/snZKJcYGWFOxFUxzG2RWDuCK2u3.jpg',
   'credit_id': '57ac9472925141473900077e',
   'department': 'Production',
   'job': 'Co-Producer'},
  {'adult': False,
   'gender': 0,
   'id': 1330586,
   'known_for_department': 'Costume & Make-Up',
   'name': 'Morag Ross',
   'original_name': 'Morag Ross',
   'popularity': 2.14,
   'profile_path': '/ve64qIlQHviwyDkIEhDbi9TvhKM.jpg',
   'credit_id': '5e8c96503a340b001603e284',
   'department': 'Costume & Make-Up',
   'job': 'Makeup Artist'},
  {'adult': False,
   'gender': 2,
   'id': 1339343,
   'known_for_department': 'Sound',
   'name': 'Robert Edwards',
   'original_name': 'Robert Edwards',
   'popularity': 1.96,
   'profile_path': '/zIAGFNrc0g75D32PMR3wO3WquUk.jpg',
   'credit_id': '5ba80e049251412f0a030a26',
   'department': 'Sound',
   'job': 'ADR Recordist'},
  {'adult': False,
   'gender': 2,
   'id': 1393443,
   'known_for_department': 'Sound',
   'name': 'Robert Jackson',
   'original_name': 'Robert Jackson',
   'popularity': 1.4,
   'profile_path': None,
   'credit_id': '5eab6f381b157d0024c71d4e',
   'department': 'Sound',
   'job': 'Supervising Sound Editor'},
  {'adult': False,
   'gender': 0,
   'id': 1396794,
   'known_for_department': 'Sound',
   'name': 'Gabriel J. Serrano',
   'original_name': 'Gabriel J. Serrano',
   'popularity': 1.4,
   'profile_path': None,
   'credit_id': '5e8c969aad87f75dd76a8b90',
   'department': 'Sound',
   'job': 'Sound Re-Recording Mixer'},
  {'adult': False,
   'gender': 0,
   'id': 1406918,
   'known_for_department': 'Art',
   'name': 'Brendan Rankin',
   'original_name': 'Brendan Rankin',
   'popularity': 0.694,
   'profile_path': None,
   'credit_id': '5e8c96334b0c633ca72c711c',
   'department': 'Art',
   'job': 'Art Direction'},
  {'adult': False,
   'gender': 2,
   'id': 1456041,
   'known_for_department': 'Sound',
   'name': 'Oleg Kulchytskyi',
   'original_name': 'Oleg Kulchytskyi',
   'popularity': 0.98,
   'profile_path': None,
   'credit_id': '5e8c96b14b0c633d962c8ff6',
   'department': 'Sound',
   'job': 'Sound Re-Recording Mixer'},
  {'adult': False,
   'gender': 0,
   'id': 1737946,
   'known_for_department': 'Art',
   'name': 'Colman Corish',
   'original_name': 'Colman Corish',
   'popularity': 1.094,
   'profile_path': None,
   'credit_id': '5e8c96151056110011860915',
   'department': 'Art',
   'job': 'Art Direction'}]}

In [47]:
cast=[]
director = []
count=0
for record in range(len(json_responses)):
    
    if 'cast' in json_responses[record]:
        if len(json_responses[record]['cast'])>=6:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name'],
                         json_responses[record]['cast'][2]['name'],
                         json_responses[record]['cast'][3]['name'],
                         json_responses[record]['cast'][4]['name'],
                         json_responses[record]['cast'][5]['name']])
            
        elif len(json_responses[record]['cast'])==5:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name'],
                         json_responses[record]['cast'][2]['name'],
                         json_responses[record]['cast'][3]['name'],
                         json_responses[record]['cast'][4]['name']])
            
        elif len(json_responses[record]['cast'])==4:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name'],
                         json_responses[record]['cast'][2]['name'],
                         json_responses[record]['cast'][3]['name']])
            
        elif len(json_responses[record]['cast'])==3:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name'],
                         json_responses[record]['cast'][2]['name']])
            
        elif len(json_responses[record]['cast'])==2:
            cast.append([json_responses[record]['cast'][0]['name'],
                         json_responses[record]['cast'][1]['name']])
            
        elif len(json_responses[record]['cast'])==1:
            cast.append([json_responses[record]['cast'][0]['name']])
            
            
        else:
            cast.append('unknown')
            
    else:
        cast.append('unknown')
            
            
    if 'crew' in json_responses[record]:
        for member in json_responses[record]['crew']:
                if member['job'] == 'Director':
                    director.append(member['name'])
                    break
        else:
            director.append('unknown')
            
    else:
        director.append('unknown')
    count+=1

In [49]:
len(cast), len(director)

(2515, 2515)

In [53]:
cast[0:5]

[['Amy Adams',
  'Matthew Goode',
  'John Lithgow',
  'Flaminia Cinque',
  'Tony Rohr',
  'Pat Laffan'],
 ['Tim Allen',
  'Sigourney Weaver',
  'Ray Liotta',
  'J.K. Simmons',
  'Julie Bowen',
  'Kelsey Grammer'],
 ['Mamoru Miyano',
  'Ayumi Uehara',
  'Daisuke Namikawa',
  'Yuka Hirata',
  'Showtaro Morikubo',
  'Tomokazu Sugita'],
 ['Denzel Washington',
  'Gary Oldman',
  'Mila Kunis',
  'Ray Stevenson',
  'Jennifer Beals',
  'Michael Gambon'],
 ['Jackie Chan',
  'Amber Valletta',
  'Madeline Carroll',
  'Alina Foley',
  'Magnús Scheving',
  'Billy Ray Cyrus']]

In [54]:
director[0:5]

['Anand Tucker',
 'Tim Allen',
 'Daisuke Namikawa',
 'Albert Hughes',
 'Brian Levant']

In [55]:
movies_df2['cast'] = cast
movies_df2['director'] = director

In [56]:
movies_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2515 entries, 0 to 2514
Data columns (total 7 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         2515 non-null   object
 1   release_year  2515 non-null   int64
 2   imdb_id       2515 non-null   object
 3   poster        2515 non-null   object
 4   tmdb_id       2515 non-null   object
 5   cast          2515 non-null   object
 6   director      2515 non-null   object
dtypes: int64(1), object(6)
memory usage: 137.7+ KB

In [57]:
movies_df2.head()

,title,release_year,imdb_id,poster,tmdb_id,cast,director
0,Leap Year,2010,tt1216492,https://m.media-amazon.com/images/M/MV5BMTgzMT...,25195,"[Amy Adams, Matthew Goode, John Lithgow, Flami...",Anand Tucker
1,Crazy on the Outside,2010,tt1196134,https://m.media-amazon.com/images/M/MV5BMTgzMj...,35458,"[Tim Allen, Sigourney Weaver, Ray Liotta, J.K....",Tim Allen
2,Wonderful World,2010,tt6622356,https://m.media-amazon.com/images/M/MV5BY2EwMW...,451573,"[Mamoru Miyano, Ayumi Uehara, Daisuke Namikawa...",Daisuke Namikawa
3,The Book of Eli,2010,tt1037705,https://m.media-amazon.com/images/M/MV5BNTE1OW...,20504,"[Denzel Washington, Gary Oldman, Mila Kunis, R...",Albert Hughes
4,The Spy Next Door,2010,tt1273678,https://m.media-amazon.com/images/M/MV5BMTI5Mj...,23172,"[Jackie Chan, Amber Valletta, Madeline Carroll...",Brian Levant

In [58]:
movies_df2.tail()

,title,release_year,imdb_id,poster,tmdb_id,cast,director
2510,The Whale,2022,tt11909878,https://m.media-amazon.com/images/M/MV5BODcxYz...,642885,"[Bette Midler, Sarah Jessica Parker, Kathy Naj...",Anne Fletcher
2511,5000 Blankets,2022,tt4595186,https://m.media-amazon.com/images/M/MV5BNzJlMT...,799546,"[Mila Kunis, Chiara Aurelia, Finn Wittrock, Co...",Mike Barker
2512,The Pale Blue Eye,2022,tt12908110,https://m.media-amazon.com/images/M/MV5BMmY3NG...,723419,"[Donald Sutherland, Jaeden Martell, Kirby Howe...",John Lee Hancock
2513,A Man Called Otto,2022,tt14668630,https://m.media-amazon.com/images/M/MV5BNmE1MT...,830784,"[Shawn Mendes, Javier Bardem, Winslow Fegley, ...",Josh Gordon
2514,"Alice, Darling",2022,tt10304142,https://m.media-amazon.com/images/M/MV5BNDQwNz...,664469,"[Christian Bale, Margot Robbie, John David Was...",David O. Russell

collecting genres and production company

In [61]:
url = "https://api.themoviedb.org/3/movie/{}?language=en-US"

headers = {
    "accept": "application/json",
    "Authorization": "Bearer eyJhbGciOiJIUzI1NiJ9.eyJhdWQiOiJjYTY0OTg4MmMxZGM2YzIwM2RhNDcxY2ExMDJmY2MxNyIsInN1YiI6IjY0NzczYmFkMTJjNjA0MDEzZWQ5MGFjNyIsInNjb3BlcyI6WyJhcGlfcmVhZCJdLCJ2ZXJzaW9uIjoxfQ.-Saw_BrZ_WDQkMvZ04gfVwwiVR6HSpHO2QiiWAOjYxA"
}

def call_apis(session, df, variable):
    tasks = []
    for ids in df[variable].values:
        tasks.append(asyncio.create_task(session.get(url.format(ids), headers=headers)))

    return tasks

async def get_data(df, variable):
    async with aiohttp.ClientSession() as session:
        tasks = call_apis(session, df, variable)
        responses = await asyncio.gather(*tasks)
        json_responses = []
        for response in responses:
            json_response = await response.json()
            json_responses.append(json_response)
         
        
        return json_responses

In [64]:
start = time.time()
# Run the code
json_responses = await get_data(movies_df2, 'tmdb_id')

end = time.time()
total_time = end - start
print("It took {} seconds to make {} API calls".format(total_time, len(movies_df2['tmdb_id'].values)))
print('You did it!')

It took 31.351059198379517 seconds to make 2515 API calls
You did it!

In [66]:
genres = []
production_companies = []
count=0

for i in range(len(json_responses)):
    
    if len(json_responses[i]) > 1 and 'genres' in json_responses[i]:
        
        genres_temp = []
        for j in range(len(json_responses[i]['genres'])):
            genres_temp.append(json_responses[i]['genres'][j]['name'])
        
        genres.append(genres_temp)
        
    else:
        genres.append('unknown')
        
    count+=1
    
    if len(json_responses[i]) > 1 and 'production_companies' in json_responses[i]:
        
        production_companies_temp = []
        for j in range(len(json_responses[i]['production_companies'])):
            production_companies_temp.append(json_responses[i]['production_companies'][j]['name'])
        
        production_companies.append(production_companies_temp)
        
    else:
        production_companies.append('unknown')

In [68]:
len(genres), len(production_companies)

(2515, 2515)

In [70]:
genres[:5],

([['Romance', 'Comedy'],
  ['Comedy', 'Romance'],
  [],
  ['Action', 'Thriller', 'Science Fiction'],
  ['Action', 'Comedy', 'Family']],
 [['Birnbaum / Barber Productions',
   'Universal Pictures',
   'Spyglass Entertainment',
   'Octagon Films',
   'BenderSpink'],
  [],
  [],
  ['Alcon Entertainment', 'Silver Pictures'],
  ['Spy Next Door',
   'Relativity Media',
   'Robert Simonds Productions',
   'Lionsgate',
   'Mandate International'],
  ['Double Feature Films', 'CBS Films']])

In [72]:
production_companies[:6]

[['Birnbaum / Barber Productions',
  'Universal Pictures',
  'Spyglass Entertainment',
  'Octagon Films',
  'BenderSpink'],
 [],
 [],
 ['Alcon Entertainment', 'Silver Pictures'],
 ['Spy Next Door',
  'Relativity Media',
  'Robert Simonds Productions',
  'Lionsgate',
  'Mandate International'],
 ['Double Feature Films', 'CBS Films']]

In [73]:
movies_df2['genres'] = genres
movies_df2['production_companies'] = production_companies

In [74]:
movies_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2515 entries, 0 to 2514
Data columns (total 9 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   title                 2515 non-null   object
 1   release_year          2515 non-null   int64
 2   imdb_id               2515 non-null   object
 3   poster                2515 non-null   object
 4   tmdb_id               2515 non-null   object
 5   cast                  2515 non-null   object
 6   director              2515 non-null   object
 7   genres                2515 non-null   object
 8   production_companies  2515 non-null   object
dtypes: int64(1), object(8)
memory usage: 177.0+ KB

In [77]:
#movies_df2.to_csv('movies_df2.csv', index=False)